tavishi-gupta/SmartAICane/esp32_classifier2/app_httpd.cpp
// Copyright 2015-2016 Espressif Systems (Shanghai) PTE LTD
//
// Licensed under the Apache License, Version 2.0 (the "License");
// you may not use this file except in compliance with the License.
// You may obtain a copy of the License at
//
//     http://www.apache.org/licenses/LICENSE-2.0
//
// Unless required by applicable law or agreed to in writing, software
// distributed under the License is distributed on an "AS IS" BASIS,
// WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
// See the License for the specific language governing permissions and
// limitations under the License.
#include "esp_http_server.h"
#include "esp_timer.h"
#include "esp_camera.h"
#include "img_converters.h"
#include "fb_gfx.h"
#include "esp32-hal-ledc.h"
#include "sdkconfig.h"
#include "camera_index.h"
#include "board_config.h"
#include "esp_heap_caps.h"
#include <ArduTFLite.h>
#include "model_int8.h"

// =========================================================================
// Object classifier (ArduTFLite) — added on top of the base CameraWebServer.
// Serves predictions at GET /classify as JSON: {"label":"...","confidence":0.87}
// =========================================================================

// ---- Update this to match labels.txt (from train.py), in the same order ----
static const char *CLASS_LABELS[] = {
  "Bench", "Bicycle Rack", "Bike", "Building", "Bus",
  "Car", "Chair", "Dog", "Dustbin", "Electrical Pole",
  "Fire hydrant", "Guard rail", "Motorcycle", "Pedestrian crosswalk", "Person",
  "Plant Pot", "Stairs", "Traffic Cone", "Traffic sign", "Tree",
  "Truck", "obstacle-detection", "unknown"
};
static const int NUM_CLASSES = 23;
static const int MODEL_IMG_SIZE = 96;  // must match IMG_SIZE in train.py

// Tensor arena — allocated from PSRAM at init time (see classifier_init()).
// Increase kTensorArenaSize if modelInit() fails.
static const int kTensorArenaSize = 200 * 1024;
static uint8_t *tensorArena = nullptr;
static bool classifierReady = false;

void classifier_init() {
  tensorArena = (uint8_t *)heap_caps_malloc(kTensorArenaSize, MALLOC_CAP_SPIRAM);
  if (!tensorArena) {
    log_e("Failed to allocate tensor arena in PSRAM");
    return;
  }
  classifierReady = modelInit(model_int8_tflite, tensorArena, kTensorArenaSize);
  if (!classifierReady) {
    log_e("Classifier model init failed — try increasing kTensorArenaSize");
  } else {
    log_i("Classifier ready");
  }
}

// Nearest-neighbor downsample an RGB888 buffer to MODEL_IMG_SIZE x MODEL_IMG_SIZE
// and feed it into the model, normalized the same way train.py did
// (MobileNetV2 preprocess_input: pixel/127.5 - 1.0, range [-1, 1]).
static void feed_model_from_rgb888(uint8_t *rgb, int width, int height) {
  int idx = 0;
  for (int y = 0; y < MODEL_IMG_SIZE; y++) {
    int srcY = y * height / MODEL_IMG_SIZE;
    for (int x = 0; x < MODEL_IMG_SIZE; x++) {
      int srcX = x * width / MODEL_IMG_SIZE;
      int srcIdx = (srcY * width + srcX) * 3;
      uint8_t r = rgb[srcIdx + 0];
      uint8_t g = rgb[srcIdx + 1];
      uint8_t b = rgb[srcIdx + 2];
      modelSetInput((r / 127.5f) - 1.0f, idx++);
      modelSetInput((g / 127.5f) - 1.0f, idx++);
      modelSetInput((b / 127.5f) - 1.0f, idx++);
    }
  }
}

static esp_err_t classify_handler(httpd_req_t *req) {
  httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");

  if (!classifierReady) {
    httpd_resp_set_type(req, "application/json");
    return httpd_resp_send(req, "{\"error\":\"classifier not ready\"}", HTTPD_RESP_USE_STRLEN);
  }

  camera_fb_t *fb = esp_camera_fb_get();
  if (!fb) {
    log_e("Camera capture failed");
    return httpd_resp_send_500(req);
  }

  // Convert whatever format the camera is in (JPEG or RGB565) to RGB888.
  size_t rgb_len = (size_t)fb->width * fb->height * 3;
  uint8_t *rgb_buf = (uint8_t *)heap_caps_malloc(rgb_len, MALLOC_CAP_SPIRAM);
  bool ok = false;
  int fb_width = fb->width;
  int fb_height = fb->height;
  if (rgb_buf) {
    ok = fmt2rgb888(fb->buf, fb->len, fb->format, rgb_buf);
  }
  esp_camera_fb_return(fb);

  if (!ok) {
    if (rgb_buf) {
      free(rgb_buf);
    }
    log_e("RGB conversion failed");
    return httpd_resp_send_500(req);
  }

  feed_model_from_rgb888(rgb_buf, fb_width, fb_height);
  free(rgb_buf);

  if (!modelRunInference()) {
    log_e("Inference failed");
    return httpd_resp_send_500(req);
  }

  float best_score = -1e9;
  int best_index = -1;
  for (int i = 0; i < NUM_CLASSES; i++) {
    float score = modelGetOutput(i);
    if (score > best_score) {
      best_score = score;
      best_index = i;
    }
  }

  char resp[128];
  snprintf(
    resp, sizeof(resp), "{\"label\":\"%s\",\"confidence\":%.3f}", (best_index >= 0 ? CLASS_LABELS[best_index] : "unknown"), best_score
  );

  httpd_resp_set_type(req, "application/json");
  return httpd_resp_send(req, resp, strlen(resp));
}

#if defined(ARDUINO_ARCH_ESP32) && defined(CONFIG_ARDUHAL_ESP_LOG)
#include "esp32-hal-log.h"
#endif

// LED FLASH setup
#if defined(LED_GPIO_NUM)
#define CONFIG_LED_MAX_INTENSITY 255

int led_duty = 0;
bool isStreaming = false;

#endif

typedef struct {
  httpd_req_t *req;
  size_t len;
} jpg_chunking_t;

#define PART_BOUNDARY "123456789000000000000987654321"
static const char *_STREAM_CONTENT_TYPE = "multipart/x-mixed-replace;boundary=" PART_BOUNDARY;
static const char *_STREAM_BOUNDARY = "\r\n--" PART_BOUNDARY "\r\n";
static const char *_STREAM_PART = "Content-Type: image/jpeg\r\nContent-Length: %u\r\nX-Timestamp: %d.%06d\r\n\r\n";

httpd_handle_t stream_httpd = NULL;
httpd_handle_t camera_httpd = NULL;

typedef struct {
  size_t size;   //number of values used for filtering
  size_t index;  //current value index
  size_t count;  //value count
  int sum;
  int *values;  //array to be filled with values
} ra_filter_t;

static ra_filter_t ra_filter;

static ra_filter_t *ra_filter_init(ra_filter_t *filter, size_t sample_size) {
  memset(filter, 0, sizeof(ra_filter_t));

  filter->values = (int *)malloc(sample_size * sizeof(int));
  if (!filter->values) {
    return NULL;
  }
  memset(filter->values, 0, sample_size * sizeof(int));

